lib/tasks/autoload_models.rake

INSERT INTO "users" ("first_name", "last_name", "status", "created_at", "updated_at", "email", "encrypted_password") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  task users: :environment do
    path = Rails.root.join("users.csv")
    password='mot_de_passe'
    CSV.foreach(path, headers: true) do |row|
      row_without_id = row.to_hash
      row_without_id.delete("id")
      row_without_id[:password] = password
      row_without_id[:password_confirmation] = password
      User.create!(row_without_id)

INSERT INTO "accounts" ("utility", "category", "account_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["utility", "pepco"], ["category", "residential"], ["account_number", "2349-23422"], ["user_id", 1], ["created_at", "2018-08-06 19:47:08.909176"], ["updated_at", "2018-08-06 19:47:08.909176"]]
---
  task accounts: :environment do
    path = Rails.root.join("accounts.csv")
    CSV.foreach(path, headers: true) do |row|
      row_without_id = row.to_hash
      row_without_id.delete("id")
      row_without_id["category"] = row_without_id.delete("type")
      Account.create!(row_without_id)

INSERT INTO "bills" ("start_date", "end_date", "usage", "charges", "status", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  task bills: :environment do
    path = Rails.root.join("bills.csv")
    CSV.foreach(path, headers: true) do |row|
      row_without_id = row.to_hash
      row_without_id.delete("id")
      Bill.create!(row_without_id)