app/controllers/admin/bills_controller.rb

  def create
    @bill = Bill.new(bill_params)

    if @bill.save
---
INSERT INTO "bills" ("start_date", "end_date", "usage", "charges", "status", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @bill.destroy
---
DELETE FROM "bills" WHERE "bills"."id" = ?  [["id", 31]]

    def set_bill
      @bill = Bill.find(params[:id])
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]