app/controllers/admin/stats_controller.rb

SELECT COUNT(*) FROM "users"
---
  def user_activity
    total_user_count = User.count