app/controllers/api/v1/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 1]]
---
      def create
        @account = current_user.accounts.find_or_initialize_by(account_params)