app/controllers/api/v1/accounts_controller.rb

INSERT INTO "accounts" ("utility", "category", "account_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["utility", "pepco"], ["category", "commercial"], ["account_number", "1234567"], ["user_id", 2], ["created_at", "2018-08-19 22:49:54.190700"], ["updated_at", "2018-08-19 22:49:54.190700"]]
---
      def create
        @account = current_user.accounts.new(account_params)

        if @account.save

UPDATE "accounts" SET "utility" = ?, "category" = ?, "account_number" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["utility", "MEH"], ["category", "residential"], ["account_number", "123"], ["updated_at", "2018-08-19 23:27:28.581334"], ["id", 10]]
---
      def update
        if @account.update(account_params)

DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 11]]
---
      def destroy
        @account.destroy

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."account_number" = ? LIMIT ?  [["user_id", 2], ["account_number", "1234567"], ["LIMIT", 1]]
---
        def set_account
          @account = current_user.accounts.find_by_account_number(params[:account_number])

SELECT  "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND (cast(strftime('%Y', start_date) as int) = 2018 AND cast(strftime('%m', start_date) as int) = 8 ) ORDER BY "bills"."id" ASC LIMIT ?  [["account_id", 11], ["LIMIT", 1]]
---
        def prev_twelve_bills_usage(account)
          bills = {}
          for i in 0..12 do
            month = (Date.today - i.month).month
            year = (Date.today - i.month).year
            month_year = (Date.today - i.month).strftime("%B %Y")
            bill = account.bills.by_month(month, year).first