app/controllers/api/v1/bills_controller.rb

      def pay_by_month

        if bill_params(:status)[:status] != "paid"
          render json: { errors: "You can only perform a 'pay' action on a bill" }
        elsif @bill.status == "paid"
          render json: { errors: "Bill has already been paid" }, status: :unprocessable_entity
        else
          if @bill.update(bill_params(:status))
---
UPDATE "bills" SET "status" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["status", "paid"], ["updated_at", "2018-08-20 02:02:35.629408"], ["id", 10]]

      def set_bill
        month = params[:start_date].split('-')[1]
        year = params[:start_date].split('-')[0]
        @bill = account.bills.by_month(month, year).first
---
SELECT  "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND (cast(strftime('%Y', start_date) as int) = '2017' AND cast(strftime('%m', start_date) as int) = '12' ) LIMIT ?  [["account_id", 2], ["LIMIT", 11]]