app/controllers/api/v1/bills_controller.rb

SELECT "bills".* FROM "bills" WHERE "bills"."account_id" = ?  [["account_id", 1]]
---
      def index
        @bills = @account.bills.all

UPDATE "bills" SET "status" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["status", "paid"], ["updated_at", "2018-08-20 02:02:35.629408"], ["id", 10]]
---
      def update # pay bill
        if @bill.status == "paid"
          render json: { errors: ['Bill has already been paid'] }, status: :unprocessable_entity
        else
          if @bill.update(bill_params(:status))

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."account_number" = ? LIMIT ?  [["account_number", "2349-23422"], ["LIMIT", 1]]
---
      def set_account
        @account = Account.find_by_account_number(params[:account_number])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."account_number" = ? LIMIT ?  [["account_number", "2349-23422"], ["LIMIT", 1]]
---
      def account
        Account.find_by_account_number(params[:account_number])

SELECT  "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND "bills"."id" = ? LIMIT ?  [["account_id", 1], ["id", 2018], ["LIMIT", 1]]
---
      def set_bill
        @bill = account.bills.find(params[:id])