app/controllers/api/v1/admin/accounts_controller.rb

      def index
        @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

      def create
        @account = Account.new(account_params)

        if @account.save
---
INSERT INTO "accounts" ("utility", "category", "account_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["utility", "MEH"], ["category", "residential"], ["account_number", "123423423"], ["user_id", 1], ["created_at", "2018-08-20 03:27:57.073537"], ["updated_at", "2018-08-20 03:27:57.073537"]]

      def update
        if @account.update(account_params)
---
UPDATE "accounts" SET "utility" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["utility", "HEE"], ["updated_at", "2018-08-20 03:33:26.822760"], ["id", 26]]

      def destroy
        @account.destroy
---
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 26]]

        def set_account
          @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]