app/controllers/api/v1/admin/bills_controller.rb

      def index
        @bills = Bill.all
---
SELECT "bills".* FROM "bills"

      def create
        @bill = Bill.new(bill_params)

        if @bill.save
---
INSERT INTO "bills" ("start_date", "end_date", "usage", "charges", "status", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

      def update
        if @bill.update(bill_params)
---
UPDATE "bills" SET "account_id" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["account_id", 2], ["updated_at", "2018-08-20 14:37:51.629565"], ["id", 32]]

      def destroy
        @bill.destroy
---
DELETE FROM "bills" WHERE "bills"."id" = ?  [["id", 32]]

      def set_bill
        @bill = Bill.find(params[:id])
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]