app/controllers/api/v1/admin/stats_controller.rb

SELECT COUNT(*) FROM "users"
---
      def user_activity
        total_user_count = User.count

SELECT COUNT(*) FROM "accounts"
---
      def account_type_breakdown
        residential_count = Account.residential.count