app/controllers/api/v1/admin/users_controller.rb

      def show_by_email
        @user = User.find_by_email! params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "john.johnson@yahoo.com"], ["LIMIT", 1]]