app/controllers/api/v1/admin/users_controller.rb

      def create
        binding.pry
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at", "email", "encrypted_password") VALUES (?, ?, ?, ?, ?, ?)

      def update
        if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "MEHH"], ["encrypted_password", "$2a$11$Rz0O11aqEkLE1Uy7VFTtS.MWt58QOOKedprEFe1P5bU5PGjxqiiKS"], ["updated_at", "2018-08-20 02:52:52.881832"], ["id", 7]]

      def email
        binding.pry
        @user = User.find_by_email! params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@gmail.com"], ["LIMIT", 1]]