app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."account_number" = ? LIMIT ?  [["account_number", "2349-23422"], ["LIMIT", 1]]
---
    def set_account
      @account = current_user.accounts.find_by_account_number(params[:account_number])