app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 1]]
---
  def index
    @accounts = @current_user.accounts.all

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
---
    def set_account
      @account = @current_user.accounts.find(params[:id])