app/controllers/bills_controller.rb

SELECT  "bills".* FROM "bills" WHERE "bills"."start_date" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def get_bill_by_start_month
    @bill = current_account.bills.find_by_start_date(params[:start_date])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def current_account
      Account.find(params[:account_id])

SELECT  "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND "bills"."id" = ? LIMIT ?  [["account_id", 3], ["id", 7], ["LIMIT", 1]]
---
    def set_bill
      @bill = current_account.bills.find(params[:id])