app/controllers/bills_controller.rb

SELECT "bills".* FROM "bills"
---
  def index
    @bills = @account.bills.all

UPDATE "bills" SET "status" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["status", "paid"], ["updated_at", "2018-08-08 20:11:24.665018"], ["id", 5]]
---
  def update # pay bill
    if @bill.status == "paid"
      render json: {Error: "Bill has already been paid"}
    else
      if @bill.update(bill_params(:status))

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."account_number" = ? LIMIT ?  [["account_number", "2349-23422"], ["LIMIT", 1]]
---
    def set_account
      @account = Account.find_by_account_number(params[:account_number])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."account_number" = ? LIMIT ?  [["account_number", "2349-23422"], ["LIMIT", 1]]
---
    def account
      Account.find_by_account_number(params[:account_number])

SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_bill
      @bill = account.bills.find(params[:id])