app/controllers/customer_account_controller.rb

INSERT INTO "accounts" ("utility", "category", "account_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["utility", "duke_energy"], ["category", "residential"], ["account_number", "123"], ["user_id", 1], ["created_at", "2018-08-08 19:21:12.832200"], ["updated_at", "2018-08-08 19:21:12.832200"]]
---
  def create_new_account
    binding.pry
    #WORK ON VALIDATION: a new account should only be created if it's unique for the user
    # (utility + account_number) combo must be unique
    @account = current_user.accounts.new(account_params)

    if @account.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."account_number" = ? LIMIT ?  [["user_id", 1], ["account_number", "123"], ["LIMIT", 1]]
---
    def set_account
      @account = current_user.accounts.find_by_account_number(params[:account_number])

SELECT  "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND (cast(strftime('%Y', start_date) as int) = 2018 AND cast(strftime('%m', start_date) as int) = 8 ) ORDER BY "bills"."id" ASC LIMIT ?  [["account_id", 8], ["LIMIT", 1]]
---
    def prev_twelve_bills_usage(account)
      bills = {}
      for i in 0..12 do
        month = (Date.today - i.month).month
        year = (Date.today - i.month).year
        month_year = (Date.today - i.month).strftime("%B %Y")
        bill = account.bills.by_month(month, year).first