app/controllers/customer_controller.rb

SELECT "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND (cast(strftime('%Y', start_date) as int) = '2018' AND cast(strftime('%m', start_date) as int) = '05' )  [["account_id", 1]]
---
  def pay_bill #bill_id or start_date?
    @bill = @account.bills.find(params[:bill_id])

SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 1]]
---
    def has_two_accounts
      current_user.accounts.count == 2

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."category" = ? LIMIT ?  [["user_id", 1], ["category", "residential"], ["LIMIT", 1]]
---
    def residential_account
      current_user.accounts.find_by_category("residential")

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."account_number" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    def set_account
      @account = current_user.accounts.find_by_account_number(params[:account_number])

SELECT  "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND (cast(strftime('%Y', start_date) as int) = 2018 AND cast(strftime('%m', start_date) as int) = 8 ) ORDER BY "bills"."id" ASC LIMIT ?  [["account_id", 1], ["LIMIT", 1]]
---
    def prev_twelve_bills_usage_by_account_type(account)
      bills = {}
      for i in 0..12 do
        month = (Date.today - i.month).month
        year = (Date.today - i.month).year
        month_year = (Date.today - i.month).strftime("%B %Y")
        bill = account.bills.by_month(month, year).first