app/controllers/registrations_controller.rb

SELECT "users"."email" FROM "users"
---
  	def response_to_sign_up_failure(resource)
  		if resource.email == "" && resource.password == nil
  			redirect_to root_path, alert: "Please fill out the form"
  		elsif User.pluck(:email).include? resource.email