app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sam1234@msn"], ["LIMIT", 1]]
---
  def email
    @user = User.find_by!(email: params[:email])