app/models/account.rb

SELECT COUNT(*) FROM "accounts"
---
  def self.residential_type_percentage
    percentage(residential.count.to_f, count.to_f)

SELECT COUNT(*) FROM "accounts"
---
  def self.commercial_type_percentage
    percentage(commercial.count.to_f, count.to_f)

SELECT  "bills".* FROM "bills" WHERE "bills"."account_id" = ? AND (cast(strftime('%Y', start_date) as int) = 2018 AND cast(strftime('%m', start_date) as int) = 8 ) ORDER BY "bills"."id" ASC LIMIT ?  [["account_id", 2], ["LIMIT", 1]]
---
  def prev_twelve_bills_usage
    bills = {}
    for i in 0..12 do
      month = (Date.today - i.month).month
      year = (Date.today - i.month).year
      month_year = (Date.today - i.month).strftime("%B %Y")
      bill = self.bills.by_month(month, year).first