app/models/bill.rb

SELECT AVG("bills"."usage") FROM "bills" WHERE (cast(strftime('%Y', start_date) as int) = 2018 AND cast(strftime('%m', start_date) as int) = 8 )
---
 def self.monthly_average_usage(month, year = Date.today.year)
    by_month(month, year).average(:usage)