app/models/user.rb

SELECT COUNT(*) FROM "users"
---
  def self.active_percentage
    percentage(active.count.to_f, count.to_f)

SELECT COUNT(*) FROM "users"
---
  def self.inactive_percentage
    percentage(inactive.count.to_f, count.to_f)